---
title: "Database operations with python"
date: 2019-01-25T19:14:46+05:30
draft: False
author: "Nitin Patil"

---

The SQLAlchemy library abstracts away many of the common differences between SQL databases. pandas has a `read_sql` function that enables you to read data easily from a general SQLAlchemy connection. Additionally the `DataFrame.to_sql` function lets us write the dataframe as table in SQL databse.

In [60]:
import sqlalchemy as db
import pandas as pd
import warnings
warnings.filterwarnings('ignore')

### Connect with SQL database

In [61]:
# Create an engine to the `test` database
# The typical form of a database URL is `dialect+driver://username:password@host:port/database`
engine = db.create_engine('mysql+pymysql://root:root@localhost:3306/test')

For now our database has single table.

In [62]:
# Print the table names
engine.table_names()

['users']

### Pandas DataFrame

Create a dataframe with simple data

In [63]:
columns = ['country', 'continent', 'area', 'population', 'gdp']

data = [('Afghanistan', 'Asia', 647500, 31056997, 700),
       ('India', 'Asia', 3287590, 1095351995, 2900)]

In [64]:
df = pd.DataFrame(data=data, columns=columns)
df

       country continent     area  population   gdp
0  Afghanistan      Asia   647500    31056997   700
1        India      Asia  3287590  1095351995  2900

### Creata table in SQL database

Write all the records stored in a DataFrame to a SQL database as table named `country`

In [65]:
df.to_sql('country', con=engine, 
          index=False # Do not want DataFrame index as a table column
         )

We can see the table is created in database

In [66]:
engine.table_names()

['country', 'users']

### Read SQL table

We can read the SQL database table conveniently with `read_sql` function. It returns the table in `DataFrame` object.

In [67]:
pd.read_sql("SELECT * FROM country", engine)

       country continent     area  population   gdp
0  Afghanistan      Asia   647500    31056997   700
1        India      Asia  3287590  1095351995  2900

### Append to SQL table

In [68]:
# create another dataframe with some more nations entry

more_data = [('China', 'Asia', 9596960, 1313973713, 5000),
       ('United States', 'North America', 9631420, 298444215, 37800),
       ('Brazil', 'South America', 8511965, 188078227, 7600),
       ('South Africa', 'Africa', 1219912, 44187637, 10700),
       ('France', 'Europe', 547030,	60876136, 27600)]

df1 = pd.DataFrame(data=more_data, columns=columns)

Append the data in database table

In [69]:
# With `if_exists='append'` the SQL table gets appended
df1.to_sql('country', con=engine, if_exists='append', index=False)

In [70]:
pd.read_sql("SELECT * FROM country", engine)

         country      continent     area  population    gdp
0    Afghanistan           Asia   647500    31056997    700
1          India           Asia  3287590  1095351995   2900
2          China           Asia  9596960  1313973713   5000
3  United States  North America  9631420   298444215  37800
4         Brazil  South America  8511965   188078227   7600
5   South Africa         Africa  1219912    44187637  10700
6         France         Europe   547030    60876136  27600

### Delete records from SQL table

In [71]:
drop_query = """DELETE FROM country 
                WHERE country = 'China'
                """

In [72]:
engine.execute(drop_query)

In [73]:
pd.read_sql("SELECT * FROM country", engine)

         country      continent     area  population    gdp
0    Afghanistan           Asia   647500    31056997    700
1          India           Asia  3287590  1095351995   2900
2  United States  North America  9631420   298444215  37800
3         Brazil  South America  8511965   188078227   7600
4   South Africa         Africa  1219912    44187637  10700
5         France         Europe   547030    60876136  27600

### Drop table

You can completely drop the table.

In [74]:
drop_query = "DROP TABLE country"
engine.execute(drop_query);

In [75]:
engine.table_names()

['users']

### References
- http://docs.sqlalchemy.org
- https://pandas.pydata.org/pandas-docs/stable/